session_3/blogspot/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "topic", "tags", "content", "created_at", "updated_at", "user_id", "public") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    @article.user_id = current_user.id

    if @article.save

UPDATE "articles" SET "updated_at" = ?, "public" = ? WHERE "articles"."id" = ?  [["updated_at", "2021-01-19 02:14:34.095751"], ["public", 0], ["id", 2]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)